Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/m13design/m13_ra6m3_ek/ftp_client_demo/keil/startup_ra6m3.S
#include "bsp_irq_cfg.h"

; Amount of memory (in bytes) allocated for Stack
; Tailor this value to your application needs
; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Stack_Size      EQU     0x400;

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

;Heap_Size      EQU     0x200;

;                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
;__heap_base
;Heap_Mem        SPACE   Heap_Size
;__heap_limit

                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset
                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size
                EXPORT  __Options
                EXPORT  __Options_End
                EXPORT  __Options_Size

__Vectors       DCD     __initial_sp               ; Top of Stack
                DCD     Reset_Handler              ; Reset Handler
                DCD     NMI_Handler                ; NMI Handler
                DCD     HardFault_Handler          ; Hard Fault Handler
                DCD     MemManage_Handler          ; MPU Fault Handler
                DCD     BusFault_Handler           ; Bus Fault Handler
                DCD     UsageFault_Handler         ; Usage Fault Handler
                DCD     0                          ; Reserved
                DCD     0                          ; Reserved
                DCD     0                          ; Reserved
                DCD     0                          ; Reserved
                DCD     SVC_Handler                ; SVCall Handler
                DCD     DebugMon_Handler           ; Debug Monitor Handler
                DCD     0                          ; Reserved
                DCD     PendSV_Handler             ; PendSV Handler
                DCD     SysTick_Handler            ; SysTick Handler

                ; External Interrupts
                IF      BSP_IRQ_CFG_ICU_IRQ0 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ1 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ2 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ2_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ3 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ3_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ4 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ4_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ5 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ5_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ6 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ6_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ7 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ7_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ8 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ8_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ9 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ9_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ10 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ10_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ11 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ11_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ12 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ12_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ13 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ13_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ14 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ14_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ15 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ15_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC0_INT != BSP_IRQ_DISABLED
                DCD     DMAC0_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC1_INT != BSP_IRQ_DISABLED
                DCD     DMAC1_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC2_INT != BSP_IRQ_DISABLED
                DCD     DMAC2_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC3_INT != BSP_IRQ_DISABLED
                DCD     DMAC3_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC4_INT != BSP_IRQ_DISABLED
                DCD     DMAC4_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC5_INT != BSP_IRQ_DISABLED
                DCD     DMAC5_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC6_INT != BSP_IRQ_DISABLED
                DCD     DMAC6_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC7_INT != BSP_IRQ_DISABLED
                DCD     DMAC7_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DTC_COMPLETE != BSP_IRQ_DISABLED
                DCD     DTC_COMPLETE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DTC_END != BSP_IRQ_DISABLED
                DCD     DTC_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_SNOOZE_CANCEL != BSP_IRQ_DISABLED
                DCD     ICU_SNOOZE_CANCEL_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_FCU_FIFERR != BSP_IRQ_DISABLED
                DCD     FCU_FIFERR_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_FCU_FRDYI != BSP_IRQ_DISABLED
                DCD     FCU_FRDYI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_LVD_LVD1 != BSP_IRQ_DISABLED
                DCD     LVD_LVD1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_LVD_LVD2 != BSP_IRQ_DISABLED
                DCD     LVD_LVD2_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CGC_MOSC_STOP != BSP_IRQ_DISABLED
                DCD     CGC_MOSC_STOP_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_LPM_SNOOZE_REQUEST != BSP_IRQ_DISABLED
                DCD     LPM_SNOOZE_REQUEST_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT0_INT != BSP_IRQ_DISABLED
                DCD     AGT0_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT0_COMPARE_A != BSP_IRQ_DISABLED
                DCD     AGT0_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT0_COMPARE_B != BSP_IRQ_DISABLED
                DCD     AGT0_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT1_INT != BSP_IRQ_DISABLED
                DCD     AGT1_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT1_COMPARE_A != BSP_IRQ_DISABLED
                DCD     AGT1_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT1_COMPARE_B != BSP_IRQ_DISABLED
                DCD     AGT1_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IWDT_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     IWDT_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_WDT_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     WDT_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_RTC_ALARM != BSP_IRQ_DISABLED
                DCD     RTC_ALARM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_RTC_PERIOD != BSP_IRQ_DISABLED
                DCD     RTC_PERIOD_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_RTC_CARRY != BSP_IRQ_DISABLED
                DCD     RTC_CARRY_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_SCAN_END != BSP_IRQ_DISABLED
                DCD     ADC0_SCAN_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_SCAN_END_B != BSP_IRQ_DISABLED
                DCD     ADC0_SCAN_END_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_WINDOW_A != BSP_IRQ_DISABLED
                DCD     ADC0_WINDOW_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_WINDOW_B != BSP_IRQ_DISABLED
                DCD     ADC0_WINDOW_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_COMPARE_MATCH != BSP_IRQ_DISABLED
                DCD     ADC0_COMPARE_MATCH_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_COMPARE_MISMATCH != BSP_IRQ_DISABLED
                DCD     ADC0_COMPARE_MISMATCH_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_SCAN_END != BSP_IRQ_DISABLED
                DCD     ADC1_SCAN_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_SCAN_END_B != BSP_IRQ_DISABLED
                DCD     ADC1_SCAN_END_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_WINDOW_A != BSP_IRQ_DISABLED
                DCD     ADC1_WINDOW_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_WINDOW_B != BSP_IRQ_DISABLED
                DCD     ADC1_WINDOW_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_COMPARE_MATCH != BSP_IRQ_DISABLED
                DCD     ADC1_COMPARE_MATCH_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC1_COMPARE_MISMATCH != BSP_IRQ_DISABLED
                DCD     ADC1_COMPARE_MISMATCH_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ACMPHS0_INT != BSP_IRQ_DISABLED
                DCD     ACMPHS0_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ACMPHS1_INT != BSP_IRQ_DISABLED
                DCD     ACMPHS1_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ACMPHS2_INT != BSP_IRQ_DISABLED
                DCD     ACMPHS2_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ACMPHS3_INT != BSP_IRQ_DISABLED
                DCD     ACMPHS3_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ACMPHS4_INT != BSP_IRQ_DISABLED
                DCD     ACMPHS4_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ACMPHS5_INT != BSP_IRQ_DISABLED
                DCD     ACMPHS5_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_USBFS_FIFO_0 != BSP_IRQ_DISABLED
                DCD     USBFS_FIFO_0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_USBFS_FIFO_1 != BSP_IRQ_DISABLED
                DCD     USBFS_FIFO_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_USBFS_INT != BSP_IRQ_DISABLED
                DCD     USBFS_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_USBFS_RESUME != BSP_IRQ_DISABLED
                DCD     USBFS_RESUME_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC0_RXI != BSP_IRQ_DISABLED
                DCD     IIC0_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC0_TXI != BSP_IRQ_DISABLED
                DCD     IIC0_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC0_TEI != BSP_IRQ_DISABLED
                DCD     IIC0_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC0_ERI != BSP_IRQ_DISABLED
                DCD     IIC0_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC0_WUI != BSP_IRQ_DISABLED
                DCD     IIC0_WUI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC1_RXI != BSP_IRQ_DISABLED
                DCD     IIC1_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC1_TXI != BSP_IRQ_DISABLED
                DCD     IIC1_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC1_TEI != BSP_IRQ_DISABLED
                DCD     IIC1_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC1_ERI != BSP_IRQ_DISABLED
                DCD     IIC1_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC2_RXI != BSP_IRQ_DISABLED
                DCD     IIC2_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC2_TXI != BSP_IRQ_DISABLED
                DCD     IIC2_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC2_TEI != BSP_IRQ_DISABLED
                DCD     IIC2_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC2_ERI != BSP_IRQ_DISABLED
                DCD     IIC2_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SSI0_TXI != BSP_IRQ_DISABLED
                DCD     SSI0_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SSI0_RXI != BSP_IRQ_DISABLED
                DCD     SSI0_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SSI0_INT != BSP_IRQ_DISABLED
                DCD     SSI0_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SSI1_TXI_RXI != BSP_IRQ_DISABLED
                DCD     SSI1_TXI_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SSI1_INT != BSP_IRQ_DISABLED
                DCD     SSI1_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SRC_INPUT_FIFO_EMPTY != BSP_IRQ_DISABLED
                DCD     SRC_INPUT_FIFO_EMPTY_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SRC_OUTPUT_FIFO_FULL != BSP_IRQ_DISABLED
                DCD     SRC_OUTPUT_FIFO_FULL_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SRC_OUTPUT_FIFO_OVERFLOW != BSP_IRQ_DISABLED
                DCD     SRC_OUTPUT_FIFO_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SRC_OUTPUT_FIFO_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     SRC_OUTPUT_FIFO_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SRC_CONVERSION_END != BSP_IRQ_DISABLED
                DCD     SRC_CONVERSION_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_PDC_RECEIVE_DATA_READY != BSP_IRQ_DISABLED
                DCD     PDC_RECEIVE_DATA_READY_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_PDC_FRAME_END != BSP_IRQ_DISABLED
                DCD     PDC_FRAME_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_PDC_INT != BSP_IRQ_DISABLED
                DCD     PDC_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CTSU_WRITE != BSP_IRQ_DISABLED
                DCD     CTSU_WRITE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CTSU_READ != BSP_IRQ_DISABLED
                DCD     CTSU_READ_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CTSU_END != BSP_IRQ_DISABLED
                DCD     CTSU_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_KEY_INT != BSP_IRQ_DISABLED
                DCD     KEY_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DOC_INT != BSP_IRQ_DISABLED
                DCD     DOC_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAC_FREQUENCY_ERROR != BSP_IRQ_DISABLED
                DCD     CAC_FREQUENCY_ERROR_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAC_MEASUREMENT_END != BSP_IRQ_DISABLED
                DCD     CAC_MEASUREMENT_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAC_OVERFLOW != BSP_IRQ_DISABLED
                DCD     CAC_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN0_ERROR != BSP_IRQ_DISABLED
                DCD     CAN0_ERROR_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN0_FIFO_RX != BSP_IRQ_DISABLED
                DCD     CAN0_FIFO_RX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN0_FIFO_TX != BSP_IRQ_DISABLED
                DCD     CAN0_FIFO_TX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN0_MAILBOX_RX != BSP_IRQ_DISABLED
                DCD     CAN0_MAILBOX_RX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN0_MAILBOX_TX != BSP_IRQ_DISABLED
                DCD     CAN0_MAILBOX_TX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN1_ERROR != BSP_IRQ_DISABLED
                DCD     CAN1_ERROR_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN1_FIFO_RX != BSP_IRQ_DISABLED
                DCD     CAN1_FIFO_RX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN1_FIFO_TX != BSP_IRQ_DISABLED
                DCD     CAN1_FIFO_TX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN1_MAILBOX_RX != BSP_IRQ_DISABLED
                DCD     CAN1_MAILBOX_RX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN1_MAILBOX_TX != BSP_IRQ_DISABLED
                DCD     CAN1_MAILBOX_TX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IOPORT_EVENT_1 != BSP_IRQ_DISABLED
                DCD     IOPORT_EVENT_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IOPORT_EVENT_2 != BSP_IRQ_DISABLED
                DCD     IOPORT_EVENT_2_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IOPORT_EVENT_3 != BSP_IRQ_DISABLED
                DCD     IOPORT_EVENT_3_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IOPORT_EVENT_4 != BSP_IRQ_DISABLED
                DCD     IOPORT_EVENT_4_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ELC_SOFTWARE_EVENT_0 != BSP_IRQ_DISABLED
                DCD     ELC_SOFTWARE_EVENT_0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ELC_SOFTWARE_EVENT_1 != BSP_IRQ_DISABLED
                DCD     ELC_SOFTWARE_EVENT_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_POEG0_EVENT != BSP_IRQ_DISABLED
                DCD     POEG0_EVENT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_POEG1_EVENT != BSP_IRQ_DISABLED
                DCD     POEG1_EVENT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_POEG2_EVENT != BSP_IRQ_DISABLED
                DCD     POEG2_EVENT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_POEG3_EVENT != BSP_IRQ_DISABLED
                DCD     POEG3_EVENT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT0_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT0_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT0_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT0_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT0_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT0_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT0_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT0_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT0_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT0_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT0_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT0_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT0_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT0_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT0_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT0_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT0_AD_TRIG_A != BSP_IRQ_DISABLED
                DCD     GPT0_AD_TRIG_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT0_AD_TRIG_B != BSP_IRQ_DISABLED
                DCD     GPT0_AD_TRIG_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT1_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT1_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT1_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT1_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT1_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT1_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT1_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT1_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_AD_TRIG_A != BSP_IRQ_DISABLED
                DCD     GPT1_AD_TRIG_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_AD_TRIG_B != BSP_IRQ_DISABLED
                DCD     GPT1_AD_TRIG_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT2_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT2_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT2_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT2_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT2_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT2_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT2_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT2_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_AD_TRIG_A != BSP_IRQ_DISABLED
                DCD     GPT2_AD_TRIG_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_AD_TRIG_B != BSP_IRQ_DISABLED
                DCD     GPT2_AD_TRIG_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT3_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT3_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT3_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT3_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
