Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/m13design/m13_ra6m3_ek/ftp_client_demo/keil/startup_ra6m3.S
                IF      BSP_IRQ_CFG_GPT3_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT3_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT3_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT3_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT3_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT3_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT3_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT3_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT3_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT3_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT3_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT3_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT3_AD_TRIG_A != BSP_IRQ_DISABLED
                DCD     GPT3_AD_TRIG_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT3_AD_TRIG_B != BSP_IRQ_DISABLED
                DCD     GPT3_AD_TRIG_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT4_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT4_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT4_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT4_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT4_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT4_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT4_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT4_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_AD_TRIG_A != BSP_IRQ_DISABLED
                DCD     GPT4_AD_TRIG_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_AD_TRIG_B != BSP_IRQ_DISABLED
                DCD     GPT4_AD_TRIG_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT5_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT5_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT5_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT5_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT5_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT5_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT5_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT5_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_AD_TRIG_A != BSP_IRQ_DISABLED
                DCD     GPT5_AD_TRIG_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_AD_TRIG_B != BSP_IRQ_DISABLED
                DCD     GPT5_AD_TRIG_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT6_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT6_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT6_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT6_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT6_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT6_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT6_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT6_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_AD_TRIG_A != BSP_IRQ_DISABLED
                DCD     GPT6_AD_TRIG_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT6_AD_TRIG_B != BSP_IRQ_DISABLED
                DCD     GPT6_AD_TRIG_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT7_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT7_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT7_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT7_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT7_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT7_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT7_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT7_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_AD_TRIG_A != BSP_IRQ_DISABLED
                DCD     GPT7_AD_TRIG_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT7_AD_TRIG_B != BSP_IRQ_DISABLED
                DCD     GPT7_AD_TRIG_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT8_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT8_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT8_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT8_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT8_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT8_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT8_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT8_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT8_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT9_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT9_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT9_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT9_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT9_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT9_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT9_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT9_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT9_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT10_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT10_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT10_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT10_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT10_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT10_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT10_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT10_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT10_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT10_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT10_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT10_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT10_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT10_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT10_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT10_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT11_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT11_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT11_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT11_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT11_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT11_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT11_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT11_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT11_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT11_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT11_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT11_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT11_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT11_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT11_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT11_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT12_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT12_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT12_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT12_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT12_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT12_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT12_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT12_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT12_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT12_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT12_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT12_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT12_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT12_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT12_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT12_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT13_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT13_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT13_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT13_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT13_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT13_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT13_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT13_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT13_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT13_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT13_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT13_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT13_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT13_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT13_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT13_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_OPS_UVW_EDGE != BSP_IRQ_DISABLED
                DCD     OPS_UVW_EDGE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_IPLS != BSP_IRQ_DISABLED
                DCD     EPTPC_IPLS_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_MINT != BSP_IRQ_DISABLED
                DCD     EPTPC_MINT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_PINT != BSP_IRQ_DISABLED
                DCD     EPTPC_PINT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EDMAC0_EINT != BSP_IRQ_DISABLED
                DCD     EDMAC0_EINT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER0_RISE != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER0_RISE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER1_RISE != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER1_RISE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER2_RISE != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER2_RISE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER3_RISE != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER3_RISE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER4_RISE != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER4_RISE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER5_RISE != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER5_RISE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER0_FALL != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER0_FALL_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER1_FALL != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER1_FALL_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER2_FALL != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER2_FALL_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER3_FALL != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER3_FALL_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER4_FALL != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER4_FALL_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_EPTPC_TIMER5_FALL != BSP_IRQ_DISABLED
                DCD     EPTPC_TIMER5_FALL_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_USBHS_FIFO_0 != BSP_IRQ_DISABLED
                DCD     USBHS_FIFO_0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_USBHS_FIFO_1 != BSP_IRQ_DISABLED
                DCD     USBHS_FIFO_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_USBHS_USB_INT_RESUME != BSP_IRQ_DISABLED
                DCD     USBHS_USB_INT_RESUME_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_RXI != BSP_IRQ_DISABLED
                DCD     SCI0_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_TXI != BSP_IRQ_DISABLED
                DCD     SCI0_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_TEI != BSP_IRQ_DISABLED
                DCD     SCI0_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_ERI != BSP_IRQ_DISABLED
                DCD     SCI0_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_AM != BSP_IRQ_DISABLED
                DCD     SCI0_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_RXI_OR_ERI != BSP_IRQ_DISABLED
                DCD     SCI0_RXI_OR_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI1_RXI != BSP_IRQ_DISABLED
                DCD     SCI1_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI1_TXI != BSP_IRQ_DISABLED
                DCD     SCI1_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI1_TEI != BSP_IRQ_DISABLED
                DCD     SCI1_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI1_ERI != BSP_IRQ_DISABLED
                DCD     SCI1_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI1_AM != BSP_IRQ_DISABLED
                DCD     SCI1_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI2_RXI != BSP_IRQ_DISABLED
                DCD     SCI2_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI2_TXI != BSP_IRQ_DISABLED
                DCD     SCI2_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI2_TEI != BSP_IRQ_DISABLED
                DCD     SCI2_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI2_ERI != BSP_IRQ_DISABLED
                DCD     SCI2_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI2_AM != BSP_IRQ_DISABLED
                DCD     SCI2_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_RXI != BSP_IRQ_DISABLED
                DCD     SCI3_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_TXI != BSP_IRQ_DISABLED
                DCD     SCI3_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_TEI != BSP_IRQ_DISABLED
                DCD     SCI3_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_ERI != BSP_IRQ_DISABLED
                DCD     SCI3_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_AM != BSP_IRQ_DISABLED
                DCD     SCI3_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_RXI != BSP_IRQ_DISABLED
                DCD     SCI4_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_TXI != BSP_IRQ_DISABLED
                DCD     SCI4_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_TEI != BSP_IRQ_DISABLED
                DCD     SCI4_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_ERI != BSP_IRQ_DISABLED
                DCD     SCI4_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_AM != BSP_IRQ_DISABLED
                DCD     SCI4_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI5_RXI != BSP_IRQ_DISABLED
                DCD     SCI5_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI5_TXI != BSP_IRQ_DISABLED
                DCD     SCI5_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI5_TEI != BSP_IRQ_DISABLED
                DCD     SCI5_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI5_ERI != BSP_IRQ_DISABLED
                DCD     SCI5_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI5_AM != BSP_IRQ_DISABLED
                DCD     SCI5_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI6_RXI != BSP_IRQ_DISABLED
                DCD     SCI6_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI6_TXI != BSP_IRQ_DISABLED
                DCD     SCI6_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI6_TEI != BSP_IRQ_DISABLED
                DCD     SCI6_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI6_ERI != BSP_IRQ_DISABLED
                DCD     SCI6_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI6_AM != BSP_IRQ_DISABLED
                DCD     SCI6_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI7_RXI != BSP_IRQ_DISABLED
                DCD     SCI7_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI7_TXI != BSP_IRQ_DISABLED
                DCD     SCI7_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI7_TEI != BSP_IRQ_DISABLED
                DCD     SCI7_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI7_ERI != BSP_IRQ_DISABLED
                DCD     SCI7_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI7_AM != BSP_IRQ_DISABLED
                DCD     SCI7_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI8_RXI != BSP_IRQ_DISABLED
                DCD     SCI8_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI8_TXI != BSP_IRQ_DISABLED
                DCD     SCI8_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI8_TEI != BSP_IRQ_DISABLED
                DCD     SCI8_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI8_ERI != BSP_IRQ_DISABLED
                DCD     SCI8_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI8_AM != BSP_IRQ_DISABLED
                DCD     SCI8_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_RXI != BSP_IRQ_DISABLED
                DCD     SCI9_RXI_IRQHandler
                ENDIF
