Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/m13design/m13_ra6m3_ek/ftp_client_demo/keil/startup_ra6m3.S
                IF      BSP_IRQ_CFG_SCI9_TXI != BSP_IRQ_DISABLED
                DCD     SCI9_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_TEI != BSP_IRQ_DISABLED
                DCD     SCI9_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_ERI != BSP_IRQ_DISABLED
                DCD     SCI9_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_AM != BSP_IRQ_DISABLED
                DCD     SCI9_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_RXI != BSP_IRQ_DISABLED
                DCD     SPI0_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_TXI != BSP_IRQ_DISABLED
                DCD     SPI0_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_IDLE != BSP_IRQ_DISABLED
                DCD     SPI0_IDLE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_ERI != BSP_IRQ_DISABLED
                DCD     SPI0_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_TEI != BSP_IRQ_DISABLED
                DCD     SPI0_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI1_RXI != BSP_IRQ_DISABLED
                DCD     SPI1_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI1_TXI != BSP_IRQ_DISABLED
                DCD     SPI1_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI1_IDLE != BSP_IRQ_DISABLED
                DCD     SPI1_IDLE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI1_ERI != BSP_IRQ_DISABLED
                DCD     SPI1_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI1_TEI != BSP_IRQ_DISABLED
                DCD     SPI1_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_QSPI_INT != BSP_IRQ_DISABLED
                DCD     QSPI_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SDHIMMC0_ACCS != BSP_IRQ_DISABLED
                DCD     SDHIMMC0_ACCS_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SDHIMMC0_SDIO != BSP_IRQ_DISABLED
                DCD     SDHIMMC0_SDIO_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SDHIMMC0_CARD != BSP_IRQ_DISABLED
                DCD     SDHIMMC0_CARD_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SDHIMMC0_DMA_REQ != BSP_IRQ_DISABLED
                DCD     SDHIMMC0_DMA_REQ_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SDHIMMC1_ACCS != BSP_IRQ_DISABLED
                DCD     SDHIMMC1_ACCS_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SDHIMMC1_SDIO != BSP_IRQ_DISABLED
                DCD     SDHIMMC1_SDIO_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SDHIMMC1_CARD != BSP_IRQ_DISABLED
                DCD     SDHIMMC1_CARD_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SDHIMMC1_DMA_REQ != BSP_IRQ_DISABLED
                DCD     SDHIMMC1_DMA_REQ_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_PROC_BUSY != BSP_IRQ_DISABLED
                DCD     SCE_PROC_BUSY_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_ROMOK != BSP_IRQ_DISABLED
                DCD     SCE_ROMOK_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_LONG_PLG != BSP_IRQ_DISABLED
                DCD     SCE_LONG_PLG_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_TEST_BUSY != BSP_IRQ_DISABLED
                DCD     SCE_TEST_BUSY_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_WRRDY_0 != BSP_IRQ_DISABLED
                DCD     SCE_WRRDY_0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_WRRDY_1 != BSP_IRQ_DISABLED
                DCD     SCE_WRRDY_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_WRRDY_4 != BSP_IRQ_DISABLED
                DCD     SCE_WRRDY_4_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_RDRDY_0 != BSP_IRQ_DISABLED
                DCD     SCE_RDRDY_0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_RDRDY_1 != BSP_IRQ_DISABLED
                DCD     SCE_RDRDY_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_INTEGRATE_WRRDY != BSP_IRQ_DISABLED
                DCD     SCE_INTEGRATE_WRRDY_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_INTEGRATE_RDRDY != BSP_IRQ_DISABLED
                DCD     SCE_INTEGRATE_RDRDY_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GLCDC_LINE_DETECT != BSP_IRQ_DISABLED
                DCD     GLCDC_LINE_DETECT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GLCDC_UNDERFLOW_1 != BSP_IRQ_DISABLED
                DCD     GLCDC_UNDERFLOW_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GLCDC_UNDERFLOW_2 != BSP_IRQ_DISABLED
                DCD     GLCDC_UNDERFLOW_2_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DRW_INT != BSP_IRQ_DISABLED
                DCD     DRW_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_JPEG_JEDI != BSP_IRQ_DISABLED
                DCD     JPEG_JEDI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_JPEG_JDTI != BSP_IRQ_DISABLED
                DCD     JPEG_JDTI_IRQHandler
                ENDIF
__Vectors_End

__Vectors_Size  EQU  __Vectors_End - __Vectors

                FILL    (0x400 - __Vectors_Size), 0xFFFFFFFF, 4

__Options       DCD     0xFFFFFFFF                 ; Option Function Select Register 0 (OFS0)
                DCD     0xFFFFFDFF                 ; Option Function Select Register 1 (OFS1)
                DCD     0xFFFFFFFC                 ; Security MPU Program Counter Start Address Register 0 (SECMPUPCS0)
                DCD     0xFFFFFFFF                 ; Security MPU Program Counter End Address Register 0 (SECMPUPCE0)
                DCD     0xFFFFFFFC                 ; Security MPU Program Counter Start Address Register 1 (SECMPUPCS1)
                DCD     0xFFFFFFFF                 ; Security MPU Program Counter End Address Register 1 (SECMPUPCE1)
                DCD     0x00FFFFFC                 ; Security MPU Region 0 Start Address Register (SECMPUS0)
                DCD     0x00FFFFFF                 ; Security MPU Region 0 End Address Register (SECMPUE0)
                DCD     0x200FFFFC                 ; Security MPU Region 1 Start Address Register (SECMPUS1)
                DCD     0x200FFFFF                 ; Security MPU Region 1 End Address Register (SECMPUE1)
                DCD     0x407FFFFC                 ; Security MPU Region 2 Start Address Register (SECMPUS2)
                DCD     0x407FFFFF                 ; Security MPU Region 2 End Address Register (SECMPUE2)
                DCD     0x400DFFFC                 ; Security MPU Region 3 Start Address Register (SECMPUS3)
                DCD     0x400DFFFF                 ; Security MPU Region 3 End Address Register (SECMPUE3)
                DCD     0xFFFFFFFF                 ; Security MPU Access Control Register (SECMPUAC)
__Options_End

__Options_Size  EQU  __Options_End - __Options

                FILL    (0x100 - __Options_Size), 0xFFFFFFFF, 4

                AREA    |.text|, CODE, READONLY

